[
    {
        "url": "https://www.imdb.com/title/tt31184028/?ref_=hm_tpks_t_2_pd_tp1_pbr_ic",
        "name": "Together",
        "rating": 6.6,
        "summary": {
            "reviews": "SpoilerGoing into this film completely blind is the play. Absolutely bonkers. I appreciate an original horror story when it gets executed to perfection. Funny, cringey (in a good way) and downright absurd. The story is interesting enough and follows cult/folk lore but the performances by Franco and Brie are the high point. Their chemistry is perfect and believable. The film highlights themes of co-dependency and fear of commitment in a truly insane way. Granted, there are cliched moments that are usually present in the horror genre. And yes, such moments are in this film, but it definitely doesn't take away from the wild ride. This film reminiscences elements from \"The Substance\" but it warrants its own distinction. Definitely up there with one of the best horror movies of the year.SpoilerWhen real-life couples star together, the resulting film can take on a fascinating meta-layer. Although their offscreen bond doesn't necessarily blur into their characters, it inevitably hovers in the background. Mike Nichols' 'Who's Afraid of Virginia Woolf?' wasn't simply a searing portrait of marital warfare; it was also Elizabeth Taylor and Richard Burton, cinema's most famous spouses, sparring with a ferocity that audiences couldn't help but connect to their tempestuous private lives. Likewise, Stanley Kubrick's 'Eyes Wide Shut' wasn't just a puzzle about desire and fidelity. Echoed against the backdrop of Tom Cruise and Nicole Kidman's highly publicized marriage, the couple's casting lent an extra layer of voyeuristic intrigue to the film. That extra-textual dimension doesn't alter the story, but it makes the fiction feel charged in ways it otherwise wouldn't. This is also the case with Michael Shanks' 'Together,' starring the real-life couple Dave Franco and Alison Brie. A body-horror à la Coralie Fargeat's 'The Substance,' the film follows long-time partners Tim and Millie, who have been drifting apart. After relocating to the countryside, they encounter a mysterious force that starts to reshape their lives, forcing them closer than ever. Soon, their romance becomes a macabre affair, as the boundaries between co-dependence and monstrosity irrevocably blur. Atmospheric, visceral and laced with dark humour, Shanks' film grips from start to finish. Essentially a Cronenbergian romantic comedy, it's bloody good fun, with some thematic weight. Shanks' narrative cleverly uses the language of body-horror to externalize the often-unspoken dynamics undermining relationships. More than an external threat, the disgusting entity that binds Tim and Millie embodies their neediness for, and resentment towards, one another. Horror has always excelled at making the abstract tangible- whether it be desire as parasite, or intimacy as contagion- and Shanks leans into that tradition with gory relish. In 'Together', the spectacle of skin and sinew isn't there for shock alone, but as a metaphor for how love can devour, how co-dependence can trap partners in a suffocating cycle of intimacy. As proceedings intensify, the couple's bond is forced into a crucible, revealing both the strength and fragility of their connection. Shanks' strong characterisation emphasises this point, especially when it comes to Tim. He is far from a traditional macho protagonist, being a vulnerable, tentative man marked by trauma. He can't work a compass or start a fire, and relies heavily on Millie in everyday situations. His hesitancy and fragility ground the film, making the couple's descent into grotesquerie more affecting than it otherwise might be. Millie, too, is drawn with nuance; a smart young teacher who loves Tim and wants the best for him, but whose patience sometimes frays under the weight of his insecurities. Together, they feel less like genre archetypes and more a realistic couple. Their exchanges throughout are natural, laced with a dry wit that feels true to life. At its core, the film is a love story, which works because one believes in Tim and Millie's bond- the tenderness beneath the terror. Visually, the film is as striking as it is unsettling. Germain McMicking's cinematography cloaks the rural setting in a pall of damp greys and muted greens, evoking both isolation and decay. Further, Nicholas Dare's production design makes the world feel intimate yet suffocating, deeply alive- disquietingly breathing. In addition, the effects work is impressively tactile, leaning on practical gore and prosthetics rather than CGI, giving things a raw, clammy immediacy. Shanks doesn't flinch from grotesque detail, yet the imagery never tips into gratuity. Just as crucial are the sound design and score: the former wringing dread from creaks, squelches and silences, the latter pulsing uneasily beneath the action without overwhelming it. Further, Sean Lahiff's editing is sharp and economical, ensuring every shock lands with precision. As Tim and Millie, Dave Franco and Alison Brie's real-life marriage lends their on-screen intimacy a raw authenticity, making Shanks' vision of closeness-turning-hideous even more disturbing. Both deliver powerhouse performances- Franco in particular, showing a vulnerability and range rarely glimpsed in his comedic work. Brie, meanwhile, plays Millie with a sharp mix of exasperation and tenderness, anchoring the film's emotional core. Damon Herriman also does fine work in a supporting role as Millie's work colleague Jamie, whose personable demeanour belies a hidden darkness. In conclusion, Michael Shanks' 'Together' is bloody great: a grisly reflection of intimacy, co-dependence and the messy realities of love. Dave Franco and Alison Brie work wonderfully together, grounding Shanks' Cronenbergian vision in something startlingly human. With tactile effects, evocative cinematography and a keen ear for dread, the film shows how passion can curdle into possession, with devastating consequences. In short, in the realm of body-horror, 'Together' stands apart.SpoilerBody horror is a genre that can be difficult to nail. At its best, it is anxiety-inducing, disturbing, and off-putting, often beyond the point of enjoyment. It is horror, not because of the scary monsters or hidden nightmares, but because of the natural human unease towards bodies being bent and broken in ways they shouldn't. As a horror genre fan, I have become desensitized to most of the tactics used to scare in movies, but body horror, done right, never fails. Together is almost that movie. It builds anxiety both through body horror and simple awkwardness, but just as it rises to the point of being unbearable, it breaks the tension, either with humor or romance. It does this well, but I was left feeling too comfortable, too comfortable for a movie purporting to be a genre based on the opposite. If they had leaned into the body horror more, unwilling to break, this could've been exceptional, but as it stands, I was left wanting. For someone who is easily scared or is new to body horror, this film could be great. The humor and romance make it more approachable, but it also detracts from the horror. Certainly not a waste of time, but it sucks to see a film come so close only to miss the mark.My girlfriend and I went to this movie as part of Landmarks mystery movie night. I found the movie really kept you guessing as to what direction it was going to go. I thought Franco and Brie were great for their respective roles. The movie took a turn halfway through that threw me off, but it brought me back in at the end. Not a revolutionary horror movie by any means but I quite enjoyed it! Recommend for anyone that's interested in checking out an original and interesting horror movie with some depth. I have found myself thinking about the film over the past few days since I saw it. It has a good mix of themes and had a few good laughs. A bit outlandish at times (maybe even most of the time) but nonetheless I found it entertaining. Check it out 🙂Together follows Tim and Millie, who find themselves at a crossroads when they move to the countryside, abandoning all that is familiar in their lives except each other. With tensions already flaring, a nightmarish encounter with a mysterious, unnatural force threatens to corrupt their lives, their love, and their flesh. The film sets everything up well. The characters, the relationship, the setting. I liked all that. The story itself was good, but the overall experience felt a bit flat and underwhelming. Things should have happen faster. When the horror, tension, or weirdness finally shows up, it's good. But it doesn't stay there. It never really sits in the moment. More time should have been spent in those moments once they happened, not necessarily more things to happen. It felt like the film was holding back when it should've leaned in. More should've happened emotionally and visually. It felt like it could've gone deeper or darker, and I was ready for it. That's one of my big issues with the film. The body horror and supernatural elements are there, but they could've gone harder with it. The trailer gave away a lot, so if you've seen it, you've probably already caught most of the big horror moments. That takes away some of the surprise, which is a shame, because the film does have its own story to tell. It's straightforward and easy to follow. What worked really well was the emotional side of it. The relationship felt real. You could see yourself in these two people, and what they're going through feels honest. Dave Franco and Alison Brie are great together. You can tell they're a real couple. There's a natural chemistry between them that makes everything feel more believable, especially as things start to fall apart. There are also a few funny little moments between them that break up the tension in a nice way, without messing with the overall vibe. Overall, Together is a solid but not groundbreaking horror/drama. It explores some interesting ideas. I just wish it had pushed things further emotionally and visually. It had all the right pieces. It just didn't go far enough with them.It doesn't happen that often that we get genuinely fresh, original ideas in horror - and when it does, it feels so bloody good. 'Together' (2025) is exactly that. A grotesque, clever, and oddly funny little gem that had me cringing, laughing, and totally hooked the entire time. The concept is unhinged in the best way: a couple moves to the countryside... and starts getting TOO attached. What unfolds is what I can best describe as a rom-com body horror (yes, really) that somehow makes co-dependency literal... and it weirdly works. So well. Body horror isn't for everyone, but this is so well done. The practical effects are gnarly in the best way - just the right amount of gross to make your stomach turn while keeping you glued to the screen. It leans into the absurdity, but underneath the chaos is a surprisingly honest look at toxic love, compromise, and identity. Alison Brie and Dave Franco are absolutely fantastic. You totally buy into them as a couple who love each other but maybe shouldn't be together. Or maybe should? I don't even know. That's part of the fun. And I have to say - any film shot in Melbourne gets an automatic bonus point from me. There's something so satisfying about seeing our suburbs twisted into something this surreal. Cringey in all the right ways. Disgusting in the best possible sense. 'Together' is one of the most original horror films I've seen in ages - and it will absolutely satisfy genre lovers looking for something bold, grotesque and new.SpoilerJust saw this in the cinema, and honestly, I left disappointed. The actors gave strong performances, but the writing didn't support them. The plot felt messy, with clunky dialogue and uneven pacing. There were a few moments of foreshadowing that hinted at something deeper, but nothing ever really came together. Despite the cast's efforts, the story just didn't deliver.There's a basic principle in filmmaking that's as old as time. If you set up your characters correctly the audience will always be invested and that's EXACTLY what you get here. From the opening you see our main characters struggles with their relationship and how they wanted to please the other but fail multiple times. The movie hit the themes of complacency and dependency and tries to disguise it as love in moments that work FLAWLESS. The actual scares are actually VERY EFFECTIVE and there's one at night that made me jump because of the sheer claustrophobic nature of the camera angles and shots. Ending: Definitely the most controversial part of the film for me. I obviously won't spoil but it completely almost ruined the film for me. It just kinda really took me out. I initially thought it would end in a different way and kinda hoped it would but no. Again that ending is really BAD so again beware that but besides that I thought this was a nice horror film.I'll be honest when I say that the trailers never properly sold me on this movie, it made it seem like a completely different movie than what we got. The concept is really unique. While there's been some chatter online about possible plagiarism, that's not my place to weigh in on. What I can say is that this film stands on its own with a bold and bizarre approach. The effects are striking, and some moments hit a level of fear and discomfort that really stays with you. It does an excellent job portraying anxiety and the disorienting terror of dreams that blur into reality. Dave Franco delivers what might be his best performance to date, giving the character a desperate vulnerability that anchors the whole thing. Alison Brie complements him perfectly, and their chemistry helps ground the madness with emotional weight and some dark humour. It's disturbing, oddly beautiful and full of surprises. If you're into surreal horror with emotional undercurrents and a touch of body horror, it's absolutely worth checking out.This is a great Body horror film that might have been missed, and it is a good thing I haven't missed it. Kudos to Chris Stuckman that recommended this one. Since he became a critic that doesn't disses films, I understand that if he uploads a review, it is a sign that the films was worth watching. This is exactly the case. Dave Franco and Alison Brie are, apparently, a married couple in real life, so this experiment of a movie with a message about relationships and how they reflect to both sides of the bond, was an interesting one. How will both actors survive each other, working together on the same movie set. This was and still it was interesting to hear an interview with both, to understand how this experience was from each side. In the movie they are a couple that haven't been married yet. He is clinging to the idea he can fulfill his musical dreams and not just as a Hobbie and she is, of course, fully dedicated to her career and trying to change scenery, to maximize her side of potential (and salary will also be nice). They both move to a new place, village, if we may call it and then troubles start happening, as they should, In a classic horror movie genre. Michael Shanks is a short movies director and not a lot of experience is mentioned in his filmography. It is certainly the best work of his, since...ever and it is interesting to see what he will make next in line. The movie is not actually scarry in the old fashioned way. It has some gore in it, it is well shot and there are a lot of horrifying bits and pieces, but towards the end, we get the body horror effect and the movie, as those genre films always go, gets wild, but not to wild and graphic, which I like and respect. Personally, I don't like the body horror genre, because it feels, for several stages, that the director is over trying to make his audience disgusted. This one is made so well, that even the parts that made me want to vomit, were somehow digestible. The best thing is the high tension of this movie and the fact it grabs the audience by the neck and doesn't let go. And this is also a movie that makes you think. About relationships in general, about your relationship and of course it makes us think about the relationship of the couple in the movie, that feels like they've done each and every mistake that is demonstrated in the book of mistakes in relationships. It is a problem to try and detach the eyes from this movie. It is well directed and both main actors makes great work and can gladly get back home with great payment to do what they love - together. It had a lot of mystery; it is great as thriller and excellent as a body horror genre movie. Great Jog.SpoilerSpoilerI left the theater about 20-30 mins ago. Overall, I really liked it The movie's premise is original, and there's a thoughtful message about relationships. The ending contains much ambiguity, which might not work for some. But I liked it. I think the film leaves a lot of room for interpretation about what happens. Whether the ending is happy or tragic, for example, is debatable, and even I feel that I could frame an argument for both sides. I found both of the leads - Alison Brie and Dave Franco - to be great. Their acting is smooth, and their characters are likable enough as protagonists. They have great romantic chemistry (some might respond by saying, \"Well duh, they're a real-life couple.\" But I've actually seen movies where real-life couples don't have on-screen chemistry; real-life relationships don't always translate on-screen. Both of them deserve credit for their performances in this movie). The movie is billed as a horror/comedy. And I guess there are some dialogue and embarassing situations that could be taken as comedy. But as a whole, I really found the movie to be more of a straight horror. And there are some creepy and unsettling moments. The gore is also not as extreme as I had heard. I never grimaced or felt the need to look away; there's no reliance on shock in this movie. The movie's pacing is good, and the run-time is just right. In terms of flaws -- the film introduces a friendly teacher at Alison Brie's job. The movie basically telegraphs that he knows more than he's letting on. There's a certain VHS scene that feels a little bit contrived; the film seems to jam that scene to explain stuff in as little time as possible. Additionally, I didn't quite grasp the backstory about Dave Franco's mother Still - a very good movie. It's not a knock-off, but this movie reminded me quite a lot of The Substance because of the general vibe (as well as a certain monster) . If you liked The Substance, you'll definitely like this one. 10/10.I'm vaguely aware of the potential plagiarism controversy surrounding Michael Shanks' 'Together (2025)', a body-horror starring real-life power couple Dave Franco and Alison Brie, but I don't know enough about it to truly form an opinion of it. From what I've seen, it is undeniably similar to 'Better Half (2023)' in terms of its premise and even a few specifics of its execution, but it's clearly aiming for a completely different tone. The fact that its screenplay has been around since 2019 also doesn't do the accusation any favours. Further to this, the film is seemingly heavily inspired visually by 'A Folded Ocean (2023)', a short with pretty much the same concept and some suspiciously almost-identical shots, even though that piece isn't involved with the lawsuit at all. It could, of course, be a case of parallel thinking (the idea of people fusing isn't exactly new territory for body-horror), but it does dampen one's enthusiasm for all involved pictures despite claims that the whole thing is a PR stunt by the makers of the supposedly ripped-off movie. I don't really know what I'm trying to say here, but I felt like I should at least acknowledge the controversy at the core of this release without pretending to have any answers about it. Perhaps the point is that the affair doesn't feel as though it's treading into new territory, and in fact feels incredibly familiar when it comes to its fundamentals (the fact that the trailer spoils pretty much every gag here doesn't help). The affair is ultimately rather slight, despite feeling like a proper horror for much of its runtime. It balances lore exploration and unsettling ambiguity pretty well, but it isn't able to truly sink its teeth into the dynamic at its core. It's thematically rather shallow, its point starting and stopping at \"codependency as horror\", and its messaging is confused at best. It doesn't help that the situation the characters find themselves in, which is meant to reflect their relationship and take it to its most literal extreme, only vaguely mirrors their actual dynamic, lacking the sense of irony it needs to feel as though it could only have happened to them (or, at least, that their story is the only one about this subject that could, and should, have been told). It's not as if the couple is outwardly afraid of commitment, making their unnatural connection their worst nightmare, but it's not as if they're especially codependent either, at least not until something starts violently pulling them together, so it also isn't a cautionary tale about losing yourself in a relationship. Both of these potential meanings are hinted towards at different times, which implies to me that the flick knows what it needs to do but just doesn't quite have the skill to do it. It also struggles to balance its tone, ostensibly being a horror-comedy but lacking much of the latter and sometimes incorporating it in clumsy ways. However, even though it isn't all that deep or keenly observed, it's still rather enjoyable for its majority. Brie and Franco are genuinely quite good, the sweaty anxiety of their increasingly magnetic scenario slowly but surely pushing them past their breaking points, and the picture often looks really accomplished, if a little too dark. The direction is playful when it needs to be and restrained when it doesn't, and most of the visual effects (many of which are aparantly practical) are believable enough that their pain outweighs their silliness. The narrative is simple but effective, the set-pieces are typically either suspenseful or intense enough to keep you on the edge of your seat, and the pacing is tight enough that you never contemplate boredom. Having said that, it definitely has its flaws. For one, it sometimes feels like something is missing, perhaps due to its notably weak theming. It isn't as immense as it perhaps could have been, nor is it as claustrophobic. It has a thick and grimy atmosphere, but it isn't particularly scary. It doesn't quite end with the \"got ya\" sting it thinks it does, and it also bizarrely pulls a lot of its punches (you're never really forced to sit with any of its body horror and, as such, none of it actually gets under your skin). Honestly, it should have been more gruesome and unsettling, even if it does have a few nicely startling images that aren't afraid of their own ridiculousness. Still, despite its issues, it's an entertaining experience that keeps you engaged for its majority. It's well-acted, well-directed, and, well, believably gnarly on occasion, missing the mark in terms of its theming and some of its horror but nailing its sickly warm cinematography and increasingly unhinged character work. It's narratively underwhelming, but formally solid. It's pretty good overall.Tim and Millie move away to try to save their failing relationship, but their problems deepen when they explore the local area. I wish I hadn't seen so many trailers for it; my algorithms bombard me with horror trailers, so I had an idea of what was coming. That aside, this film really did surprise me. Body horror isn't my favorite genre, I'll be honest, but there was a great story here, some truly unsettling scenes, a dash of humor, and some decent acting. I can't say I was crazy about either of the leading characters, but their performances seemed very deliberate; they were two people stuck in a toxic relationship, a couple that should have separated some time ago. The pacing was good, the special effects were very good; overall, this impressed me. It felt different from most of the recent horrors I've seen. Very good. 8/10.While some of the cliched tropes in the horror genre are sticked within it's narrative and characters, the original horror concept, great atmosphere, visual make-up designs and the strong performances from Dave Franco and Alison Brie offers a fun horror, comedy and body horror tale. For a debut project, director Michael Shanks really captures the horrific and bonkers nature of the body horror genre. Raving with great atmosphere, practical effects (which some were grossly cringeworthy which succeeds on the good aspects about body horror), and the direction. The writing explores some interesting themes about relationships, dependency and how bonds can be a fear within the self of someone. While I do admit some aspects, especially the way how characters are approached and some of the elements feel cheesy, the narrative works for the most. Franco and Brie has some great chemistry between one another, especially when the horror body elements are shown every time they are on screen. Although some of the dialogue moments were a bit strange, as a whole, the horror and body elements of this movie was successful. Overall, a good Midnight movie.Go look up \"A Folded Ocean\" a short by Ben Brewer in 2023. Not only did Together steal the concept, but there are also shot for shot scene recreations or theft. They have not given credit to the real writer and director, so you be the judge. How does this film have the exact scenes of the couple being merged together, as a film that came out two years earlier, and did not be considered theft?SpoilerI think we as horror fans sometimes fall into the trap of expecting every lower-budget, \"indie-but-not-really\" horror release from studios like A24 or NEON to be the \"scariest film of the year,\" or some sort of genre classic. But sometimes, it just great to see a good concept executed well. Together makes no pretense of what it is: a small-scale, nasty little summer horror flick that uses the horror elements to explore a metaphor. While Together isn't ground breaking by any means and you'd have to have absolutely no media literacy to understand what it's analogizing, I don't think that's necessarily a knock on it. In a lot of ways, Together kind of feels like \"baby's first body horror,\" a stepping stone into a genre that's accessible for horror curious audiences. I appreciate that despite being body horror to its core, the movie doesn't try and disgust its audience at every turn. Don't get me wrong - my favourite movie of 2024 was The Substance, I love my blood and gore as much as the next guy. But, I think it's nice that a film like this exists to gently bring people into this admittedly tough sub-genre to get into. I also like the clarity of what it's trying to communicate quite refreshing as well; as much as I love a film like Stop Motion, I can see why audiences would mostly leave it frustrated. Together avoids that by pretty much beating you over the head with its metaphor, but not in a way that felt like it underestimated the audience. I think the reason it works as well as it does is because Dave Franco and Alison Brie have electric chemistry, appearing as much a real couple on screen as they are in real life. There's a raw emotional honesty to their characters and relationship that's hard not to find compelling. The film does spin its wheels a bit towards the middle and at times seems uninterested in the lore it sets up. Again, this was purposeful and meant to explore the characters more than the literal plot points. I can't criticize film makers for making the \"better\" choice, even if it did make the narrative a little less sensical than I would've liked. By the time Together ended I was throughly happy with it. It's a good movie that goes in some very interesting directions and I'd recommend to anyone interested in upping their horror game. Now, would I rush back to rewatch it right away? Probably not. As much as I've praised the film for being more \"accessible\" and \"easy on the audience,\" it sort of caps the film at a \"pretty good\" level for me.Spoiler",
            "text": "**Summary:** The movie \"Together\" is a body horror film that explores the themes of co-dependency, toxic relationships, and the blurring of boundaries between two individuals. The film features a unique blend of horror, comedy, and romance, with a strong performance from the lead actors, Dave Franco and Alison Brie. While some viewers found the film to be entertaining and thought-provoking, others felt that it didn't quite live up to its full potential, with some criticizing its pacing, tone, and lack of originality. Overall, the film has received a mixed response from viewers, with some praising its originality and others finding it to be a solid, but not groundbreaking, addition to the horror genre.\n\n**Top Reviews:**\n\n1. \"I think we as horror fans sometimes fall into the trap of expecting every lower-budget, 'indie-but-not-really' horror release from studios like A24 or NEON to be the 'scariest film of the year,' or some sort of genre classic. But sometimes, it just great to see a good concept executed well. Together makes no pretense of what it is: a small-scale, nasty little summer horror flick that uses the horror elements to explore a metaphor.\" ( Matches the summary as it highlights the film's unique blend of horror and metaphorical exploration)\n2. \"The concept is unhinged in the best way: a couple moves to the countryside... and starts getting TOO attached. What unfolds is what I can best describe as a rom-com body horror (yes, really) that somehow makes co-dependency literal... and it weirdly works.\" (Matches the summary as it highlights the film's unique concept and blend of genres)\n3. \"While some of the cliched tropes in the horror genre are stuck within its narrative and characters, the original horror concept, great atmosphere, visual make-up designs and the strong performances from Dave Franco and Alison Brie offers a fun horror, comedy and body horror tale.\" (Matches the summary as it highlights the film's strengths, including its original concept and strong performances)\n4. \"Together follows Tim and Millie, who find themselves at a crossroads when they move to the countryside, abandoning all that is familiar in their lives except each other. With tensions already flaring, a nightmarish encounter with a mysterious, unnatural force threatens to corrupt their lives, their love, and their flesh.\" (Matches the summary as it provides a concise overview of the film's plot and themes)\n5. \"It's not as if the couple is outwardly afraid of commitment, making their unnatural connection their worst nightmare, but it's not as if they're especially codependent either, at least not until something starts violently pulling them together, so it also isn't a cautionary tale about losing yourself in a relationship.\" (Matches the summary as it highlights the film's exploration of co-dependency and relationships)"
        }
    },
    {
        "url": "https://www.imdb.com/title/tt5463162/?ref_=hm_tpks_t_1_pd_tp1_pbr_ic",
        "name": "Deadpool 2",
        "rating": 7.4,
        "summary": {
            "reviews": "SpoilerIt's true that you can have too much of a good thing...please no more different editions! THEATRICAL CUT - was the best version of any of the \"cuts\" it was the most cleanly edited and it had the best soundtrack out of the three. It is clear after seeing all the versions of the film that they tested all of the jokes and the ones included were cherry picked, and the best were picked to be included in this one. SUPER DUPER CUT/EXTENDED - this was supposed to be an extended version of the film but it was actually a different cut...what I mean by that is that they changed the soundtrack and they cut out what I considered to be some of the funniest jokes from the theatrical cut and replaced them. They ALSO added some additional footage to the film after making those changes. This version of the film feels darker and less funny to me personally so I prefer the theatrical cut over it. ONCE UPON A DEADPOOL/PG13 - This is the edition that nobody asked for and is the most unnecessary. From an editing standpoint this version of film is very sloppy, and seems like one giant montage. They don't even start this version of the film out at the beginning it jumps right into the \"safe room scene\". A lot of the footage included in this edition was already available on the home releases and online (apart from the short amount filmed with Fred Savage). The movie would end up edited on TV regardless of this edition existing or not. So in reality there was no need for this edition to exist apart from making more money.After his trials and tribulations in the first movie, the life of Wade Wilson (aka Deadpool) has now settled down. He's still killing bad guys, but it's more business-as-usual now. Moreover, he and girlfriend Vanessa are madly in love and want to start a family. Then a tragic event throws his life into disarray. The first Deadpool movie was great, and was a very pleasant surprise, being a comic book movie. Instead of the usual CGI-driven, all style no substance, drivel that most comic book movies are, Deadpool was a comedy, and a really good one. Outrageously funny, original and entertaining. Clever, snappy, laugh-a-minute dialogue. Some great cultural references and in-jokes, especially regarding other comic book movies. Deadpool 2 continues in the same vein. Some brilliantly funny, laugh-out-loud moments, often based around in-jokes, cultural references and film-industry-deprecating humour. More action than the first, which is disappointing. Part of Deadpool's charm is that it parodies other comic book movies. By becoming an action movie it threatens to become what it is parodying. There's always an element of humour involved though, even in the deadliest fight scenes, and in so doing the writer and director manage to avoid the hypocrisy of the film becoming what it mocks. Great work again from Ryan Reynolds as Deadpool: his comedic timing and delivery is spot-on. Good supporting cast, with Josh Brolin playing a great straight character to Reynolds' clowning.Sequels are tough. When I first saw this, I didn't think it quite lived up to the first but on rewatch that's flipped a bit. It's still a flawless Reynolds performance but now he has a solid supporting cast around him, a story that has some meat on it and, surprisingly some growth for the Merc with the Mouth. Still flawed, but so much fun. Also, much love for Domino and Cable here.A suicidal superhero comes to the rescue of a fat superhero kid who has got no friends. Will they live happily ever after? I didnt really like Deadpool 1, but I did like this sequel, because the jokes are better and thankfully there are some breathers in between the action scenes, so adults, who value characters and a good story, will be able to appreciate this movie as well. Deadpool 1 had a too fastpaced tempo, which destroyed the fabric of the movie. Deadpool 1 was more of a longwinding gimmick, this time around though the characters and the story can be enjoyed though in a normal pace, which makes for a lot more pleasurable watching experience. The action is still fantastic, but even the action is more enjoyable, because it isnt non stop as it was in Deadpool 1. A pause now and then, with some hilarious sentimental scenes between the characters, greatly enhances the fun for me of watching these sort of bizarre action comedies, which are usually only made for teenagers, but as I said before this movie can be enjoyed by adults as well. Watch out for some great short cameos by Brad Pitt and Matt Damon. And there is some great seventies and eighties music to be heard by: Dolly Parton, AC/DC, Enya, Barbara Streisand and lots of others, whose music is truly hilarious in the context of this bizarre superhero story.I actually like this better than the original which hardly ever happens. Not for the kids but damn it's entertaining for adults. Deadpool is a complex character foul, violent, vulgar, and irreverent, but also funny with a huge heart. The addition of Josh Brolin worked well against Reynolds.Not as good as the first one, however it still has a large amount of good moments. A fun over the top superhero movie that's filled with pop culture references and self-referential humor. Very enjoyable especially the end credits scenesMost superhero films are just tedious and boring because there's no elements of threats or worry that the characters might not make it through. You simply cannot emote to any of the superhero films unless you have severe emotional developmental problems or you are under the age of 12. Thankfully in Deadpool can overlook do usual tropes and stereotypes because it has a quite a bit of humor. The action displayed pretty entertaining too.I'm not a huge fan of comic character movies even though I watch them all but Deadpool is definitely my favorite Marvel character. I guess it's because he's just a bit kinkier with his sometimes vulgar sense of humor. That's something you will never see in the other Marvel or DC Comics movies. Deadpool doesn't fit in that family package as his constant humor is just above the edge. I'm normally not a huge fan of Ryan Reynolds either but I have to admit that his Deadpool character fits him as a glove. About the story it's a typical superhero against evil like all other superhero movies but that little humorous touch makes all the difference. And for a sequel it's a good one, just waiting for a third one now.Movie was pretty good, alot of action and some good actors, i just couldnt stand the kid.An unfunny mess from start to finish. No soul, recycled humour, weak story and phoned in performances. Reynolds and Brolin seemed bored. I know I was too.I loved Deadpool (2016) I was blown away by it and Reynolds commitment to the character, it was fantastic. I was however heartbroken when I saw the first trailer for this sequel, it looked pants. Not just pants, I mean granny pants. 15yr old, torn, badly stained (4 different shades) granny pants. I've never been so happy about being wrong. Deadpool 2 delivers and is easily comparable in quality to the first movie and I sure as hell did not expect that. With fantastic new additions, all the returning cast and excellent cameos this is the Deadpool sequel I desired but didn't expect (Or possibly deserve). With it's brand of over the top violence, quick fire humour, endless pop culture references and Reynolds in the role he was born to play Deadpool 2 is a worthy sequel in a franchise that I don't ever want to end if it continues like this. So damn funny, I can't wait to see what they do with the third movie. The concept however of bringing Deadpool into the existing Marvel Universe though fills me with dread. How could Deadpools brand of R rated goodness possibly fit into the Disney universe? Don't........do it! The Good: Cast are fantastic again So damn funny Action packed Soundtrack as random as it may be The incredible during credits scenes The Bad: That kid, he's just beyond annoying in everything he's in Some questionable casting choices for the new characters Things I Learnt From This Movie: Everyday should be international womans day Vinnie Jones is all grown upAfter really looking forward to this movie, I came out of the cinema slightly disappointed. Theres plenty of joke and action but the jokes seemed to be a bit meh, I only remembered laughing out loud twice and story line is a bit disjointed. The problem I had is in the DP 1 you had the shock factor of a tongue in cheek mavel character but in this movie that's already gone, so you have to rely on a good plot but unfortunately it lacked that, so I felt a little bit bored by it. I'm not saying it not a good movie but I expected a lot more but sadly I felt let down.This one was just as enjoyable as the first. Great action, tied in with humour. I've never been a fan of Marvel but have enjoyed the offerings of this franchise. I do hope they make a third.SpoilerA better quality script with better quality jokes. Good movie.SpoilerFirst of all i want to say, i didn't watch Deadpool 1 and 2 until today. I watched both films because Wolverine is in Films 3rd instalment. I watched both movies in one day and i must ask myself why didn't i watched these films before? Deadpool 2 is an even wilder and more ambitious sequel that surpasses its predecessor in nearly every way. It retains the irreverent humor and fourth-wall-breaking antics that made the first film a hit, while expanding the world and introducing a host of memorable new characters. The X-Force sequence is a masterstroke of comedic timing and brutal efficiency. The film doesn't shy away from killing off characters, a bold move that sets it apart from the typical superhero fare. Domino, with her uncanny luck, shines in this sequence, becoming an instant fan favorite. Ryan Reynolds once again delivers a tour-de-force performance, effortlessly balancing comedy, action, and heart. Cable is a formidable addition to the Deadpool universe. Josh Brolin brings a gravitas to the role that contrasts perfectly with Ryan Reynolds' manic energy. Their dynamic is a highlight, with Cable's seriousness often clashing hilariously with Deadpool's absurdity. The film's emotional core is unexpected. Colossus' sacrifice is a gut-wrenching moment that adds depth to the story. Deadpool's journey of grief and redemption is handled with surprising sensitivity. The ending, with the introduction of young mutant Firefist, hints at a potential new direction for the franchise. The action sequences are even more spectacular and creatively choreographed than in the first film. The film doesn't shy away from violence, but it's always delivered with a wink and a nudge. The emotional core of the film, however, is what truly sets it apart. Deadpool's journey through loss and grief adds depth and complexity to the character, making him even more relatable. Deadpool 2 is a masterclass in balancing humor, action, and heart. It's a film that respects its audience while pushing the boundaries of the superhero genre.Good action but overwhelming by too much jokes. You gotta do something better next time pool.Did you ever have a friend who constantly made snide remarks to try to make people laugh in order to draw attention to themselves and become liked? It works at first but after awhile becomes so annoying people quit laughing and just start ignoring the person. That basically sums up this movie. Funny for about 10 minutes, tolerable for the next 10 minutes, and annoying for the rest of the movie. As a result this movie quickly became a long, boring, clichéd. over hyped, unfunny, annoying, and disappointing mess. Linear storyline, no plot twists, forgettable characters (with the exception of Domino), uneven pacing, marginal acting, and just totally forgettable. The entire movie was lazy writing! One star for the character of Domino and one star for the rather interesting trailer insert at then end of the movie but other than that not worth watching much less paying to see it first run. Look for this one to be out in DVD by July and in the discount movie bins at Walmart by Christmas.This movie was GOLD! I enjoyed it so much, it was so pleasant!I didn't think \"DP2\" could possibly be funnier than the first? It was! A bigger budget helps but as with everything? Writing, Directing & of course, the actors make this quite a film! It's all action & hilarity, from the first scene to the last! I'm not gonna spoil it? This movie grabs you from the starting credits, until the screen goes black! Not made for children!Deadpool 2 masterfully pushes the wild humor and emotion to new heights, which sufficiently covers up narrative flaws and a misstepped social commentary. Compared to Deadpool, Deadpool 2 seems more comfortable handling the elements that made the original a success. The humor is bolder and more self-aware because the audience is already familiar with the characters. Ryan Reynolds masters the tricky balance between heavy emotion and outrageous wisecracks because the audience is trained to expect a joke for every heartfelt scene, and the movie gladly obliges. Every trick in the book is used to evoke emotional responses, but the winks to the audience make such manipulation acceptable, even welcome. For those worried that Deadpool 2 is more of the same, they needn't fret. The movie introduces a handful of new characters, each well-acted and funny in their own way. There are also some celebrity cameos sprinkled in. Sure, some of them are there solely to make a joke or two, but a couple of the new characters clearly places in future movies. Compared to some superhero movies, Deadpool 2 has a streamlined narrative and pulls off a highly successful third act. The climax of the movie not only avoids the Marvel \"villain problem,\" but it's also packed with great action, hilarious jokes, and solid character moments. This success overshadows some plot inconsistencies in the first and second act, which are minor but might bother some hypercritical audience members. Despite Deadpool 2's undeniable strengths, two features hold it back slightly. First, the subject of death is handled with such inconsistency that it seems jarring. One character's death is an unspeakable tragedy, while another's is just a comic bit. The movie missed an opportunity to make fun of the careless treatment of civilian deaths in comic-book movies, but instead fell into the trope. Deadpool 2 also tried to make a progressive commentary on diversity in superhero films, but its minority characters did not have particularly strong roles. Thus, this commentary seemed a bit undeserved and out-of-place. For fans of the original Deadpool, the sequel will not disappoint. The movie capitalizes on what it did well in the first movie and the result is a riotously entertaining, surprisingly emotional, and satisfying second installment.Your going to be hard pressed to find a movie more over the top than Deadpool 2, David leitch takes it to a whole new level entirely. It works namely because the violence here is just to creative. Sure it defies all Logic most of the time, but i was laughing and having a rip-roaring time throughout. Go into this movie knowing that it is a campy, corny, over the top superhero/action/comedy that is just about crazy shooting sequences and one-liners, and you'll be fine. Do not go into this movie expecting deep plot, meaningful conversations among characters, or anything remotely resembling a serious action or drama movie. Loved it....",
            "text": "**Summary:** Deadpool 2 is a wildly entertaining and action-packed sequel that masterfully balances humor and emotion, with Ryan Reynolds delivering a standout performance. While it may have some narrative flaws and inconsistent handling of certain themes, the movie's bold and self-aware humor, creative violence, and memorable new characters make it a satisfying and enjoyable ride. Overall, viewers found the movie to be a worthy sequel that surpasses the original in many ways, with some considering it to be one of the most entertaining superhero movies in recent years.\n\n**Top Reviews:**\n\n1. **\"Deadpool 2 masterfully pushes the wild humor and emotion to new heights, which sufficiently covers up narrative flaws and a misstepped social commentary.\"** - This review captures the essence of the movie's ability to balance humor and emotion, while also acknowledging some of its flaws.\n2. **\"I didn't think 'DP2' could possibly be funnier than the first? It was! A bigger budget helps but as with everything? Writing, Directing & of course, the actors make this quite a film!\"** - This review highlights the movie's ability to surpass the original in terms of humor and entertainment value.\n3. **\"Deadpool 2 is a masterclass in balancing humor, action, and heart. It's a film that respects its audience while pushing the boundaries of the superhero genre.\"** - This review summarizes the movie's strengths, including its ability to balance different elements and push the boundaries of the genre.\n4. **\"Your going to be hard pressed to find a movie more over the top than Deadpool 2, David leitch takes it to a whole new level entirely. It works namely because the violence here is just to creative.\"** - This review captures the movie's over-the-top nature and creative violence, which are key aspects of its entertainment value.\n5. **\"I loved Deadpool (2016) I was blown away by it and Reynolds commitment to the character, it was fantastic. I was however heartbroken when I saw the first trailer for this sequel, it looked pants. Not just pants, I mean granny pants... I've never been so happy about being wrong. Deadpool 2 delivers and is easily comparable in quality to the first movie\"** - This review highlights the movie's ability to exceed expectations and deliver a high-quality experience comparable to the original."
        }
    },
    {
        "url": "https://www.imdb.com/title/tt1312221/?ref_=hm_tenup_t_1",
        "name": "Frankenstein",
        "rating": 7.8,
        "summary": {
            "reviews": "A gothic opera soaked in sadness and snow. Guillermo del Toro's Frankenstein is the adaptation of his dreams - fierce, fragile, tragic. Jacob Elordi gives the performance of his career, portraying the Creature as a being of grace and anguish. Oscar Isaac's Victor is as tortured as he is brilliant. The film is gorgeous in every way: the production design, the costuming, the blood-red skies and green shadows. Alexandre Desplat's score lingers in your bones. But what sets this apart is the soul. Few monster movies ever ask: what happens when the monster wants to die? Fewer still answer so devastatingly.Holy s***. Finally, after a bunch of okay, mediocre and awful adaptations tackling Mary Shelley's gothic science fiction horror epic, Guillermo del Toro gets to have his vision fully realized in what's easily one of the most faithful adaptations ever made while still being his own film. The visuals are phenomenal, the acting is outstanding all around (although Isaac and Elordi are the standouts), Guillermo's writing and direction are steadfast and intimately visceral, the music is haunting, and the cinematography is some of the best of the year. I will be seeing this again in theaters, but I hope Netflix sits down and let's this epic go to IMAX. That would be one hell of an experience.What a stunning piece of art! This film is like an operatic symphony. It's both beautiful and tragic. Breathtaking and challenging. This is what movies are all about. James Whale would be proud. I saw this in Japan and because the audience is so respectful I couldn't tell if I was the only one silently weeping in the darkness. Thank you Guillermo.Experienced Del Toro's latest on the big screen in 35mm print and was left speechless. The film is far from being compact in length but managed to present some of the best cinema of 2025, an expertly crafted culmination of multiple decades of experience from Del Toro. Visually, the film is nothing short of a masterpiece. The set design, costumes, and cinematography are stunning, and every frame is a joy to look at. The visual effects (admirably, mostly practical effects) are spot on, and Desplat's score, albeit a little bit overly dramatic at times, is hauntingly beautiful and elevates the experience to a whole other level. I will admit this is the first film adaptation of Mary Shelley's classic tale that I watched, but I am familiar with some of the artistic liberties Del Toro took in his adaptation, and I think the vast majority of them are beautiful and help breathe life into the tale at modern times, while also helping differentiate it from other adaptations and giving Del Toro's unique spin to it. Similarly to his work on Pinocchio (2022), you can see his admiration and respect for the source material while you can also see his personal footprint and soul poured all over the project. Oscar Isaac is brilliant in his role as Dr. Frankenstein, and Jacob Elordi shines in a career-pivoting role. Goth and Waltz are great as well, and the film features some other pleasantly familiar faces, like Game of Thrones alums Charles Dance and David Bradley. An all-around great performance from the amazing cast completes the craft of the film as another career highlight in Del Toro's magical filmography. I will say the movie is a little bit too long while ironically the plot also takes some shortcuts and contrivances to push things forward; but that's not as dire as it sounds, and the film is enjoyable from start to finish, with great writing and directing from Del Toro. A poetic tale that mourns and dazzles, Del Toro's adaptation of \"Frankenstein\" is one of the most beautiful and well-crafted films of the year. While preserving the heart of the original tale and taking brave liberties to unify it as Guillermo's personal work, Frankenstein works on every level and manages to serve as 150 minutes of pure cinema and breathtaking entertainment.Finally someone came very close to capturing the original story. Del Toro has done an excellent job. Perhaps not for everyone, but I was enthralled. I wish it was playing in main theaters but I imagine they are worried the general superhero and monster movie crowd won't get it. Personally, this was very worth my time.The film succeeds best when it remains close to Mary Shelley's original such as in its storytelling approach and varying perspectives, as well as the dialogue and references that echo the novel. I wish there had been more of this. The book is rich in philosophy, psychology and tragedy. Del Toro doesn't fail, but I think he misses the mark at those moments where he changes the story, revising the characters' awareness and motivations. Walz's Harlander is invented and unnecessary, Isaac's Frankenstein is frenzied rather than haunted. It is Jacob Elordi's monster / creature that redeems the film, in addition to its beautiful gothic style and fine pacing (the runtime is long, but suitable). Overall, a great addition to the lore and worth seeing on the big screen.This film is peak Guillermo del Toro. Stunning cinematography, good story and character development, and stellar performances from Oscar Issac and Jacob Elordi. I went into this film with low expectations, as many films in this genre are so predictable and underwhelming. This was not the case for this film. We got a whole new look at these characters and this story, without compromising the essence of what makes it familiar. Could we have just seen the rebirth of this classic cinematic universe?It's no secret that talented and visionary director Del Toro has been working up the courage to complete Frankenstein, his biggest inspiration, for decades now. In interviews tailing many years he has told of his admiration for the story and it's effect upon him. Even some of his previous work has inspirations from the classic gothic novel, of course I'm referencing Blade 2 (believe it or not), where one of the reapers finally confronts his maker. And as a movie lover, nothing makes me happier than to see a director get to shoot his dream picture, especially a director who has contributed so much. Now compared to some other reviewer's my score may seem pretty low, and let me start by saying it's going to be loved by critics and loved by award shows, and deserves the accolades it will receive, but for me personally, I respect it more than I love it. Del Toro is a incredible director, and that's more than evident in this picture, I enjoyed the story, and his rendition of it, visually it's stunning. But, sorry to say, I'm just not a huge fan of Gothic horror, I never have been. I've tried over the years, and this movie I surprisingly enjoyed more than most, but it's something that's just not always going to be my cup of tea. There were large portions of the movie I enjoyed, there did come a part in the movie where it headlined the title 'Part 2' which I dreaded, not because I wasn't enjoying it, but I had already felt like I watched a feature movie, yet I was only half way. It was a bit long for me. Which only felt longer because of the pacing. On the positives, it looks great visually, set pieces are gothic but brilliant, and I loved the cast performances, especially Jacob Elordi as the The Creature. I was not familiar with this actor, but I give credit where it's due, that was a brilliant performance. Look. If gothic horror is not your thing, still give it a chance, it can be long winded but it's a great rendition of a classic story, I'd be surprised if you hated it even if it's not your favorite genre. If you rated it higher, I'm not going to argue with you, it probably deserves it.First off, I love a modern gothic horror adaptation, this just made my list of Halloween yearly rewatches along with Nosteratu (2024). There's just something about the visuals of rain flooded cathedral rooftops and blood flowing down cobblestone streets that gives you a faint touch of anxiety that you'll catch the plague while sitting in your theater's recliner. But I digress, Oscar Isaac is brilliant, no surprise there, from Drive to Ex Machina, his villain arc continues to grow like the hump on Igor's back. I look forward to his next role as usual. I have to admit, having never seen Euphoria, I didn't know how Jacob Elordi would play out but the dude's got range! He really brought the character to life, killed it, then brought it back to life again. Mia Goth, great mother of Pearl! I found myself falling in line behind all of the other characters in the film that fell in love with her. She never misses. Christoph Waltz... need I say more? Guillermo del Toro delivers once again! The visuals and storytelling kept me engaged, even when scenes would slow down, the emotion picked up. And this film is brutal! The creature does not hold back, he was put together to rip others apart. Go to the theater to see this one while you can! Every shot is masterfully framed and the grandiose set pieces require eyes to be feasted upon the big screen.SpoilerSimply a masterpiece. Oscar-caliber writing, directing, acting, costumes, makeup, cinematography, sound, editing, music, VFX and so much more. Every frame is gorgeous. Even though it's funded by Netflix, see it on the biggest screen possible. Truly a cinematic achievement. Kudos and congratulations to Guillermo del Toro and company. Astonishing, brilliant, redemptive, everything you would hope a movie to be.With so many people praising this movie, allow me to offer this contrary opinion. I used to like G. Del Toro; I loved Pan's Labyrinth and Pacific Rim. The Shape of Water wasn't bad either. But I think del Toro is one of those directors who made a name for themselves with their unique style, but who end up trapped by their own gimmick. Names like Tim Burton, Peter Jackson, Zack Snyder, and James Gunn, just to name a few. I had high hopes for this Frankenstein. So what's wrong with it? First, let's forget about anticipating its unveiling, since it's present from head to toe from the very first scene. We then see that it's 100% indestructible and has the strength of Superman, who also manages to free a ship stuck in the ice in Batman v Superman. It's only just begun, and we're already wondering if we're watching a monster movie or a new Marvel superhero. Still in the prelude, Oscar Isaac chooses to ignore the danger and starts recounting his life to the captain. Why? Is this something he does every time he meets a stranger, like Forest Gump sitting on a bus bench? His childhood is a series of clichés, then comes the moment when he reveals his discoveries at the Royal College of Surgeons. The animated torso is no more convincing than Ash's in the old 1979 Alien. But where I really lost interest was when he created Frankenstein. The montage sequence is dynamic and very well done, but the bad choice of music that accompanies the scene made me realized that this movie was not going to be a dark version à la Pan's Labyrinth that I had hoped for. Once assembled, the monster looks more like Nebula 2.0 with Pinocchio's brain. Furthermore, the landscapes and exterior shots all seem to be produced by VFX with all those fake rays of light passing in front of the camera. It's the kind of graphics you find in video games. Then Mia Goth's arrival transforms the film into an impossible love story, except that unlike Winona Ryder, who was full of life in Edward Scissorhands and Dracula, Goth is as expressive as a 2x4. After that, it's the creature's turn to tell his side of the story (is this a trial now?). His tale is a series of illogical events that teach us, among other things, that he can survive an explosion, like the T-1000 in T2. He can also drive fence posts into the ground by hitting them with his bare hands, just like the giants beyond the Wall, as witnessed by Jon Snow at the beginning of GOT season 3. What the captain gets from its story, however, is that Frankenstein is full of humanity, and so it is with great pleasure that the beast uses his superpowers to once again free the ship frozen in the ice. Personally, I would have liked to see Frankenstein put on his spiked boots, or see the sailors spread salt under his feet to help with traction, but oh well... I guess this is what ten years of mediocrity in Hollywood has done: today, any movie that is even remotely decent is praised as a masterpiece.SpoilerWhile very different from the book in many ways, Frankenstein (2025) still delivers key plot points and emotional beats of the original novel in expert fashion. Elordi was by far the most captivating piece of this cinematic puzzle, and I would be shocked if he isn't at least nominated for an Oscar off the back of his performance. Isaac was fantastic as Victor, and he embellished the role just enough to get the audience to love and hate him just like Mary Shelley originally intended for the character. Goth was also great, as she always is, but it was nothing that would be seen as a staple of her career like some of her other more recent works. The set design was immaculate, the score was present but never in your face, the costume design was flawless, and the supporting cast was all fantastic. My favorite cinematic piece of this film was the shots and framing. Good god, many moments of this film could have been snapshotted and turned into gorgeous posters or photography prints. Netflix really messed up by not giving this a wider release, because this film DEMANDS to be scene on a theater screen. From the moment the opening sequence began, I knew that it wasn't going to be done justice by being watched primarily at home on peoples' televisions, phones, and tablets. I'm so grateful I got to experience it in true cinematic fashion. Now, I do have some gripes, albeit personal ones, regarding the difference in the plot points, character usage, and narrative arcs that this adaptation altered from the novel. However, this film is still a massive achievement in adapting a literary work to the big screen, especially one written so long ago. This was one of my favorites of the year. Perfect for spooky season, and one of the highlights of 2025. 9.5/10.I was hesitant about going to see Frankenstein at TIFF (the plan was to wait until it hit cinemas) but I'm so glad I did. Thanks to a lovely friend I got tickets to the premiere! It's a stunning and layered film-the details! A Beautifully shot gothic tale. A technical and visual masterpiece that deserves to be seen on the big screen. You can feel the love and passion del Toro poured into the film. It honours Mary Shelley's story while adding that distinct Guillermo del Toro stamp. It reminded me of both The Shape of Water and Crimson Peak, and because of that think it's going to be a divisive film. Jacob Elordi is the standout star of the film. His portrayal of the Monster made my heart ache. Heartbreakingly beautiful and just simply phenomenal acting from him. I wish they could have explored the connection between Elizabeth and the Monster more. However, it's definitely one of my favourites of the festival so far. I can't wait to see it again.A visually beautiful, yet utterly unengaging movie. It reminds me of an elaborately decorated but empty eggshell-ey (pun intended). It's watchable of course, but you might want to see \"Mary Shelley's Frankenstein\" (1994) by Kenneth Branagh with Robert De Niro and Helena Bonham Carter instead if you haven't already.Guillermo Del Toro delivers a refreshing new take on one of the most famous horror stories of all time. Rather than crafting a typical horror film, he presents Frankenstein as an intimate and emotionally layered character study. Del Toro's deep affection for his \"monsters\" is once again evident - he consistently stands on their side, suggesting that the true monster is, in fact, Frankenstein himself. The performances are strong across the board. Oscar Isaac offers a convincing, if occasionally a little over-the-top, portrayal of Frankenstein. However, he is ultimately outshined by Jacob Elordi as the Creature. It's a challenging role that could have easily been one-dimensional, but Elordi imbues it with remarkable depth, emotion, and soul - a truly fantastic performance. Christoph Waltz delivers a familiar turn, very much in line with his recent work, while Mia Goth is solid, though it remains to be seen whether she truly lives up to her \"next big thing\" reputation. On a technical level, the film excels. The cinematography is stunning, the set design meticulous, and the score beautifully complements the film's emotional tone. The makeup work is exceptional, and while the costumes are impressive, they occasionally verge on being a bit too extravagant. If there's one major flaw, it's the runtime - the film could easily have been trimmed by at least thirty minutes. Nevertheless, this is a deeply emotional and visually striking experience, and another remarkable addition to Guillermo Del Toro's already distinguished filmography.I'm a massive fan of Guillermo's work. He's one of the only directors working in the film industry today that creates visual gothic feasts reminiscent of the movies I cherish from past decades. The colors, the lightning, the angles... he has it all. When Frankenstein was announced as his next movie project, I was elated. This man could finally create a truly faithful adaptation of Mary Shelley's classic with the stylized visual flare to back it up. With Netflix's endless funds and a stellar cast, this would've (should have) been a slam dunk. Sadly, I was more than a bit disappointed. The movie looks fantastic (as it should), and the writing is as good as one would expect from a feature of this magnitude... but the story really let me down. It strays way too far from the source material, and just like past adaptations, the things Del Toro decided to alter from the book lesson the emotional impact of the overall arc and themes. No spoilers, but many of the humanistic undertones touched on by Shelley are completely lost because of some massive character and beat changes made here. Don't get me wrong, the movie is far from terrible... I honestly don't think that Guillermo could make an awful film if he tried... but I was hoping for the definitive Frankenstein adaptation of our age and what I got was more of the same overly creative license that Hollywood has taken with every other Frankenstein that came before it. Sad. 6/10 for the visuals.Read the book in high school and loved it! This is the most faithful movie version in modern history. Though most definitely not fully accurate, I believe it carries a part of the spirit Mary Shelley intended. This movie will make you hate victor the way he deserves to be hated. Side note: Jacob Elordi has RANGE.I was really looking forward to this but in the end I was disappointed by it. Why? Overblown and overlong by at least 30.minutes. Some of the deviations from the original story were just ridiculous such as giving Victor a prosthetic leg, making Elizabeth into a 17th century trouser chasing strumpet and making the monster into Superman. Talking of the monster, no, it didn't work did it? He looked like a member of Duran Duran that hadn't quite got his Halloween make up right. The acting was OK but Mia Goth was miscast as Elizabeth and Christoph Waltz was just thrown into the.mix for gravitas. The movie did look good, I will give it that but in general this was a director who got carried away with a subject he loved in the same way that Peter Jackson did with 'King Kong'. I award it 5 5 but can't give a half mark so give it a generous 6.Firstly, hitting the negative as I found the prelude/exposition lengthy and slowly-paced. My fault, have just picked copy of shelf to reread and see what I was missing! Thereafter, was transfixed by all aspects of this tour-de-force gothic roller-coaster! Sets, costumes, locations, effects and performances all excel and are as far from Ham-it-up Horror as you can get- much as I love them! Elordi's 'monster' engages and dominates throughout with some erotic subtext that I'd never noticed before! Hope that's not just me! Now want to revisit 'Pan's Labyrinth' again as well as 'Chronos' and 'Devil's Backbone'! It's a long film but worth every minute!SpoilerWe saw Frankenstein today. I have thoughts. Within the first 10 minutes, I almost walked out of the theater, which may be the only time I have wanted to do that. I was furious that del Toro changed Dr. Frankenstein's upbringing from one of love and kindness to an abusive father. It was too much of a change for me. And why? Then Victor goes on to toil at the University in Edinburgh (huh, again why?), rather than Ingolstadt. He's there for a good 10 - 15 years, until he gets a benefactor, played by Waltz, to feed his ludicrous idea. And he certainly pays for it. This is a new character and other than providing a del Toro type magnificent yet rundown building with unlimited resources, does not serve the story; except maybe to show what a heartless liar Victor is. But why the changes and to what end? Is this just mansplaining a brilliant work by Mary Shelley, the progenitor of SciFi? I feel like del Toro thinks his audience cannot understand that a good person could be corrupted by their own bad idea. So he makes Victor a child of abuse, as if to say he was corrupted and didn't know how to love (which, in itself is a gross understanding of childhood abuse). Is it so we sympathize with the Creature? It felt so heavy handed and I love del Toro's work. Plus, we never get the brilliant quote from the Monster, \"I have love in me the likes of which you can scarcely imagine and rage the likes of which you would not believe. If I cannot satisfy the one, I will indulge the other.\" Now, if I just view the film as a film and toss the source material, which I really tried to do, I still felt it was heavy handed. Are movie goers that dense these days? Oscar Isaac was good in his madness, a little one dimensional until the end, but that wasn't his fault. In fact, everyone was pretty one dimensional, driving the plot along. Waltz was wasted. Charles Dance was Tywin Lannister, another waste. Mia Goth was boring. Except Jacob Elordi, I was expecting 1D from him and was pleasantly surprised at his work in the movie. I'll probably watch it again, but maybe not be so angry. I will try to view it as inspired by Frankenstein. In the meantime, go watch Kenneth Branagh's 1994 film, which stick far closer to the book. Also The Frankenstein Chronicles with Sean Bean is a fantastic \"based on\" and available on Netflix.I was totally mesmerized by this movie, I believe this will be the movie of the 2025 year, and rack up award nominations. Jacob Elordi gives a breakout performance of the creature. By the end of the movie, I was in tears. The production was sumptuous. Beautifully designed; sets, costumes and lit with extraordinary lighting. Beautifully directed by Guillermo del Toro.Just finished watching the movie and I am truly stunned. Everything about this movie is exceptional. The sets, costumes, performances, story, and pace kept me gripped from beginning to end. It has been a long time since I've seen a movie I've thought was a 10/10 on first viewing. The pain and sadness, hope and love, and the wonder of it all make this an incredible movie.",
            "text": "**Summary:** Guillermo del Toro's \"Frankenstein\" is a visually stunning, emotionally layered, and faithful adaptation of Mary Shelley's classic novel, with standout performances from Jacob Elordi as the Creature and Oscar Isaac as Victor Frankenstein. The film's gothic atmosphere, meticulous set design, and haunting score have captivated audiences, with many considering it a masterpiece and a strong contender for awards. While some critics have noted deviations from the original story and pacing issues, the overall sentiment is one of admiration for del Toro's unique vision and the film's ability to evoke strong emotions.\n\n**Top Reviews:**\n\n1. **\"A gothic opera soaked in sadness and snow... Guillermo del Toro's Frankenstein is the adaptation of his dreams - fierce, fragile, tragic.\"** (Review 1)\n2. **\"This film is peak Guillermo del Toro. Stunning cinematography, good story and character development, and stellar performances from Oscar Issac and Jacob Elordi.\"** (Review 9)\n3. **\"A visually beautiful, yet utterly unengaging movie... It reminds me of an elaborately decorated but empty eggshell-ey (pun intended).\"** (Review 14) - This review provides a contrasting opinion, highlighting the film's visual beauty but criticizing its emotional impact.\n4. **\"Jacob Elordi gives a breakout performance of the creature. By the end of the movie, I was in tears. The production was sumptuous. Beautifully designed; sets, costumes and lit with extraordinary lighting.\"** (Review 18)\n5. **\"Guillermo Del Toro delivers a refreshing new take on one of the most famous horror stories of all time... The performances are strong across the board, with Jacob Elordi shining as the Creature.\"** (Review 10)\n\nThese reviews represent a range of opinions, from glowing praise to more critical assessments, and provide a snapshot of the overall sentiment surrounding the film."
        }
    }
]